title: Suspicious C2 Domain Communication
id: b7b2f97e-8c9d-4db4-9850-0a9a0c5cc2e3
status: test
description: Detects use of suspicious or obfuscated domains possibly used as C2 endpoints.
author: Subhankar H.
date: 2025/04/29
references:
  - https://research.checkpoint.com/2025/apt29-phishing-campaign/
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - 'nxg|z{ob.jg}~bomkck`z.co~'    # XOR-obfuscated string
      - '.co~'                         # Possible suffix artifact
      - 'powershell'
      - 'curl'
      - 'wget'
  condition: selection
fields:
  - CommandLine
  - ParentImage
  - Image
  - User
  - Hostname
level: high
tags:
  - attack.command_and_control
  - attack.t1071.001
