title: DRAYN Malware Mutex Creation
id: 4707399c-14ba-41ff-8d66-cc7abccaa7f5
status: experimental
description: Detects the creation of a specific mutex known to be used by the DRAYN malware. This mutex is created to ensure only one instance of the malware is running and to check for prior infection.
references:
  - https://medium.com/@shubhandrew/analysis-of-a-malicious-vs-code-executable-400a1353461a
author: Subhankar H.
date: 2025-11-19
tags:
  - attack.t1543.003
  - attack.defense_evasion
logsource:
  product: windows
  category: object_access   # This is a generic category. Some EDRs may log this under 'mutex_created' or a similar category.
detection:
  selection:
        # This specific mutex name, containing a GUID, is a strong indicator of the DRAYN malware.
    ObjectName|endswith: '\RstrMgr-3887CAB8-533F-4C85-B0DC-3E5639F8D511-Session0000'
  condition: selection
falsepositives:
    # The mutex name is highly specific and unlikely to be generated by legitimate software.
  - Unlikely
level: high
